// Завдання: 19. ЗВЕРНІТЬ УВАГУ, метод findLastIndex працює на 
//версії ноди вище 18.0.0 якщо ваша версія нижче, завдання можно 
//не виконувати
// щоб перевірити версію ноди виконайте в терміналі команду node -v

/**

Функція findLastNegativeNumberIndex приймає масив чисел і 
повертає індекс останнього від'ємного числа.
Використовується метод findLastIndex() для реалізації.
 arr - вхідний масив чисел.
Повертає - lastIndex - індекс останнього від'ємного числа.
*/
function findLastNegativeNumberIndex(arr) {
    if (!Array.isArray(arr)) {return -1}
    return arr.findLastIndex(el => el < 0)
    // Перевіряємо, чи вхідний параметр є масивом, якщо ні, повертаємо -1
    // Використовуємо метод findLastIndex() для знаходження індексу останнього входження від'ємного числа
    // Повертаємо індекс останнього від'ємного числа
  }
  console.log("Завдання: 19 ==============================");
  console.log(findLastNegativeNumberIndex([1, 2, -3, 4, -5, 6, -7])); // Виведе 6
  